"use client";

import Link from "next/link";
import React from "react";
import Container from "../container";
import Marquee from "react-fast-marquee";

const NewsNavbar = () => {
  const routes = [
    {
      label:
        "সমাধান ফাউন্ডেশন একটি বেসরকারি, অলাভজনক ও অরাজনৈতিক সামাজিক সেবামূলক সংস্থা, যা সকল হিংসা, ধর্ম-বর্ণ, দলমত নির্বিশেষে একটি আদর্শ সেবা বান্ধব প্রতিষ্ঠানের মতো কাজ করে।",
      href: "/",
    },
    {
      label:
        "এর মূল লক্ষ্য হলো জবাবদিহিমূলক, শোষণমুক্ত, স্বাধীনতা ও অধিকার নিশ্চিত করে দক্ষ কর্মী গঠন এবং কর্মসংস্থান সৃষ্টি করা। মৌলিক চাহিদার অভাব দূরীকরণে কাজ করে, যা বেকারত্ব, দারিদ্র, নিরক্ষরতা এবং সন্ত্রাসমুক্ত একটি বাংলাদেশ গঠনে অবদান রাখে।",
      href: "/",
    },
    {
      label:
        "প্রতিষ্ঠাতা চেয়ারম্যানের বাণী: সমাধান ফাউন্ডেশনের প্রতিষ্ঠাতা চেয়ারম্যান খন্দকার মেহেদী হাসান দেশ ও জাতির কল্যাণে সেবামূলক কার্যক্রম পরিচালনার জন্য আল্লাহর প্রতি কৃতজ্ঞতা প্রকাশ করেছেন।",
      href: "/",
    },
    {
      label:
        "তাঁর দৃষ্টিতে, বিশাল জনসংখ্যাকে মানব সম্পদে রূপান্তরিত করে একটি সোনার বাংলাদেশ গঠন করা সম্ভব। এ লক্ষ্যে জনকল্যাণ, স্বাস্থ্যসেবা, নারীদের কর্মসংস্থান, শিক্ষা মান উন্নয়ন, কৃষি উন্নয়ন, বৈদেশিক বিনিয়োগ আকর্ষণ এবং দেশীয় পণ্য রপ্তানি নিয়ে কাজ করছে সমাধান ফাউন্ডেশন।",
      href: "/",
    },
    {
      label:
        "সেবা ও কার্যক্রম: ১. মৌলিক চাহিদা পূরণে সেবা প্রদান: অন্ন, বস্ত্র, বাসস্থান, শিক্ষা ও চিকিৎসা। ২. কর্মসংস্থান সৃষ্টি: নারীদের জন্য আত্মকর্মসংস্থান, আধুনিক কৃষি উন্নয়ন এবং সৃজনশীল ধারণা।",
      href: "/",
    },
    {
      label:
        "৩. প্রযুক্তি ও উন্নয়ন: ডিজিটাল সভ্যতার বাংলাদেশ গড়তে শিক্ষামূলক পার্ক, গবেষণাগার, কারিগরি ওয়ার্কশপ। ৪. বিশেষ উদ্যোগ: ইমাম-মুয়াজ্জিনগণের স্ত্রীরা হস্তশিল্পে প্রশিক্ষিত হতে পারবেন।",
      href: "/news/news-slug-name",
    },
    {
      label:
        "৫. সোলার সিস্টেম এবং সবুজায়ন প্রকল্প: প্রতিটি ইউনিয়নে ১০০% সোলার সিস্টেম স্থাপন।",
      href: "/",
    },
    {
      label:
        "অর্গ্যানাইজার মেম্বারশিপ: ১. যোগ্যতা: ব্যবসায়ী, চাকরিজীবী, ডেইরি ফার্ম মালিক, মাছের চাষি, পিএইচডি বা পঞ্চম শ্রেণি উত্তীর্ণ ব্যক্তিরা সদস্য হতে পারবেন।",
      href: "/",
    },
    {
      label:
        "২. সুযোগ-সুবিধা: দৈনন্দিন প্রয়োজনীয় পণ্য ৫০% ন্যায্যমূল্যে ফাউন্ডেশনের সেলস সেন্টার থেকে ক্রয় করার সুবিধা। ৩. রেজিস্ট্রেশন ফি: ন্যূনতম ডোনেশন ফি প্রদান সাপেক্ষে সদস্য পদ লাভ।",
      href: "/",
    },
    {
      label:
        "ভবিষ্যৎ লক্ষ্য ও প্রতিশ্রুতি: সমাধান ফাউন্ডেশন বাংলাদেশের প্রতিটি গ্রাম, ইউনিয়ন, উপজেলা, জেলা, এবং বিভাগে কার্যক্রম পরিচালনা করে একটি সুখী, সমৃদ্ধ, শান্তিপূর্ণ, এবং বৈষম্যমুক্ত দেশ গঠনের লক্ষ্যে কাজ করছে।",
      href: "/",
    },
    {
      label:
        "সমাধান ফাউন্ডেশন-কে সর্বাঙ্গীন সফলতা কামনা করছি। সম্মানিত চেয়ারম্যান: খন্দকার মেহেদী হাসান। SF-Govt. Reg No. (4S-138)",
      href: "/",
    },
  ];

  return (
    <section className="bg-white text-black border-b-2">
      <Container>
        <ul className="flex items-center justify-between text-xs md:text-base divide-x divide-[#ccc]">
          <Marquee pauseOnHover>
            {routes.map((route) => (
              <li
                key={route.label}
                className="font-bold p-2 transition text-center" //w-32 md:w-60
              >
                <Link href={route.href}>{route.label}</Link>
              </li>
            ))}
          </Marquee>
        </ul>
      </Container>
    </section>
  );
};

export default NewsNavbar;
